package review_복습;

/* 클래스는 하나의 개념을 통해 그 개념을 통해 그 각각의 요소들을 관리하기 위해 만듦.
ex. 학생이라는 클래스(개념)을 도입해, 각 학생별로 이름, 나이, 성적을 관리.

이렇게 정의한 클래스 안의 변수들을 멤버 변수 혹은 필드라고 한다.

클래스는 관례상 대문자로 시작하고, 낙타 표기법을 사용한다.

클래스를 사용하면, int,String과 같은 타입을 만들 수 있다. 이러한 타입의 데이터를 찍어내기 위한 설계도가 클래스라고 보면 편하다.
ex. Student라는 클래스를 만들먄, Student라는 타입을 가진 실체들을 메모리에 생성할 수 있다. 이를 객체 또는 인스턴스 라고 한다.

객체 생성 방법 : student1 = new Student();
             -> new Student()를 통해 Student 값이 들어가는 메모리를 생성하고, 그 참조값을 student1에 보관함
             
* 객체와 인스턴스의 차이 : 사실 거의 똑같지만, 인스턴스가 조금 더 관계에 초점을 둔 용어다. ex. Student 클래스에서 생성된 인스턴스 student1



 */